nc: 1  # 类别数
depth_multiple: 0.33  # YOLOv8n深度系数（保持轻量化）
width_multiple: 0.25  # YOLOv8n宽度系数
anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

# 主干网络（含动态卷积的C2f）
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 3, C2f, [128, True]]  # 2（含动态卷积）
  - [-1, 1, Conv, [256, 3, 2]] # 3
  - [-1, 6, C2f, [256, True]]  # 4（含动态卷积）
  - [-1, 1, Conv, [512, 3, 2]] # 5
  - [-1, 6, C2f, [512, True]]  # 6（含动态卷积）
  - [-1, 1, Conv, [1024, 3, 2]]# 7
  - [-1, 3, C2f, [1024, True]] # 8（含动态卷积）
  - [-1, 1, SPPF, [1024, 5]]   # 9

# 特征融合（横向堆叠PAN）
head:
  - [-1, 1, Conv, [512, 1, 1]] # 10
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]]  # 12（拼接高层与中层）
  - [-1, 3, C2f, [512, False]] # 13
  - [-1, 1, Conv, [256, 1, 1]] # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [[-1, 4], 1, Concat, [1]]  # 16（拼接中层与低层）
  - [-1, 3, C2f, [256, False]] # 17
  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19（横向堆叠：低层与高层）
  - [-1, 3, C2f, [512, False]] # 20
  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 10], 1, Concat, [1]] # 22
  - [-1, 3, C2f, [1024, False]]# 23
  # 分割头（简化版）
  - [[17, 20, 23], 1, Seg, [nc]] # 24（输出分割结果）